mirmik/zillot/zillot/stm32/usart.cpp
#include <zillot/stm32/stm32_gpio.h>
#include <zillot/stm32/stm32_usart.h>
#include <zillot/armv7e-m/arm_nvic.h>
#include <zillot/stm32/usart.h>
#include <zillot/stm32/pin.h>
#include <zillot/common/irqtable.h>
#include <chip/irqdefs.h>

void zillot::stm32::usart::init_gpio(zillot::stm32::pin tx, zillot::stm32::pin rx, int af)
{
	stm32_rcc_enable_gpio(tx.regs);
	stm32_rcc_enable_gpio(rx.regs);

	stm32_gpio_setup(tx.regs, tx.mask, GPIO_MODE_ALTERNATE);
	stm32_gpio_setup(rx.regs, rx.mask, GPIO_MODE_ALTERNATE);

	stm32_gpio_set_alternate(tx.regs, tx.mask, af);
	stm32_gpio_set_alternate(rx.regs, rx.mask, af);	
}

int zillot::stm32::usart::enable(int en)
{
	stm32_usart_enable(regs, en);
	return 0;
}

int zillot::stm32::usart::ctrirqs(uint8_t cmd)
{	
	switch (cmd)
	{
		case UART_CTRIRQS_TXON:
			stm32_usart_txirq_enable(regs, true);
			return 0;

		case UART_CTRIRQS_TXOFF:
			stm32_usart_txirq_enable(regs, false);
			return 0;
		
		case UART_CTRIRQS_RXON:
			stm32_usart_rxirq_enable(regs, true);
			return 0;
		
		case UART_CTRIRQS_RXOFF:
			stm32_usart_rxirq_enable(regs, false);
			return 0;
		
		case UART_CTRIRQS_TCON:
			stm32_usart_tcirq_enable(regs, true);
			return 0;
		
		case UART_CTRIRQS_TCOFF:
			stm32_usart_tcirq_enable(regs, false);
			return 0;
	}

	return -1;

}

int zillot::stm32::usart::recvbyte()
{
	return stm32_usart_getc(regs);

}

int zillot::stm32::usart::sendbyte(int symbol)
{
	return stm32_usart_putc(regs, symbol);
}

int zillot::stm32::usart::cantx()
{
	return stm32_usart_room(regs);
}

int zillot::stm32::usart::hasrx()
{
	return stm32_usart_avail(regs);
}

void zillot::stm32::usart::irq_handler()
{
	if (stm32_rxirq_status(regs)){
		handler(handarg, UART_IRQCODE_RX);
	}

	else if (stm32_txirq_status(regs)){
		handler(handarg, UART_IRQCODE_TX);
	}

	else if (stm32_tcirq_status(regs)) 
	{
		handler(handarg, UART_IRQCODE_TC);		
	}

	else if (stm32_overrun_irq_status(regs)) 
	{
		stm32_drop_overrun_flag(regs);
		handler(handarg, UART_IRQCODE_RX_OVERRUN);	
	}

	else 
	{
		//dpr("stm32: unh usart irq usart->ISR: ");
		//stm32_debug_print_usart_interrupt_status_register(dev->regs);
	}
}

static void _irqhandler(void *arg)
{
	zillot::stm32::usart* dev = (zillot::stm32::usart*) arg; 
	dev->irq_handler();
}

void zillot::stm32::usart::irqinit()
{
	irqtable_set_handler(irqno, &_irqhandler, (void*) this);
	nvic_enable_irq(irqno);
}

int zillot::stm32::usart::setup(int32_t baud, char parity,
                             uint8_t databits, uint8_t stopbits)
{
	//STM32 count parity bit as one of databit.
	if (parity != 'n')
		databits += 1;

	stm32_usart_setup(regs, baud, parity, databits, stopbits);
	irqinit();

	return 0;
}